assignment1/benchmarks/aws/disk_benchmark_randread_2017-06-13:21:10:28.out
randread: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
randread: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
randread: Laying out IO file(s) (1 file(s) / 64MB)
randread: Laying out IO file(s) (1 file(s) / 64MB)
randread: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randread: (groupid=0, jobs=4): err= 0: pid=5986: Tue Jun 13 21:11:12 2017
  read : io=262144KB, bw=79703KB/s, iops=19925, runt=  3289msec
    clat (usec): min=35, max=9267, avg=190.31, stdev=507.80
     lat (usec): min=36, max=9289, avg=191.47, stdev=510.03
    clat percentiles (usec):
     |  1.00th=[   40],  5.00th=[   44], 10.00th=[   63], 20.00th=[   67],
     | 30.00th=[   77], 40.00th=[   90], 50.00th=[  103], 60.00th=[  159],
     | 70.00th=[  193], 80.00th=[  221], 90.00th=[  322], 95.00th=[  414],
     | 99.00th=[  788], 99.50th=[ 1704], 99.90th=[ 8256], 99.95th=[ 8384],
     | 99.99th=[ 8768]
    bw (KB  /s): min=16504, max=22456, per=25.09%, avg=19998.00, stdev=1298.12
    lat (usec) : 50=6.23%, 100=43.01%, 250=34.41%, 500=13.40%, 750=1.85%
    lat (usec) : 1000=0.34%
    lat (msec) : 2=0.30%, 4=0.10%, 10=0.36%
  cpu          : usr=3.07%, sys=11.34%, ctx=65926, majf=0, minf=25
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=65536/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=262144KB, aggrb=79703KB/s, minb=79703KB/s, maxb=79703KB/s, mint=3289msec, maxt=3289msec

Disk stats (read/write):
  xvda1: ios=65211/0, merge=0/0, ticks=9368/0, in_queue=9352, util=93.34%