assignment1/benchmarks/aws/disk_benchmark_randread_2017-06-14:13:32:47.out
randread: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
randread: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
randread: Laying out IO file(s) (1 file(s) / 64MB)
randread: Laying out IO file(s) (1 file(s) / 64MB)
randread: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randread: (groupid=0, jobs=4): err= 0: pid=5205: Wed Jun 14 13:33:37 2017
  read : io=262144KB, bw=31372KB/s, iops=7842, runt=  8356msec
    clat (usec): min=40, max=8908, avg=504.51, stdev=358.79
     lat (usec): min=41, max=8909, avg=505.38, stdev=358.75
    clat percentiles (usec):
     |  1.00th=[   64],  5.00th=[   89], 10.00th=[  157], 20.00th=[  245],
     | 30.00th=[  326], 40.00th=[  414], 50.00th=[  458], 60.00th=[  532],
     | 70.00th=[  588], 80.00th=[  692], 90.00th=[  868], 95.00th=[ 1032],
     | 99.00th=[ 1560], 99.50th=[ 2160], 99.90th=[ 3504], 99.95th=[ 4192],
     | 99.99th=[ 8640]
    bw (KB  /s): min= 6128, max=12584, per=23.76%, avg=7454.55, stdev=1458.07
    lat (usec) : 50=0.27%, 100=6.53%, 250=13.45%, 500=35.91%, 750=27.31%
    lat (usec) : 1000=10.95%
    lat (msec) : 2=4.97%, 4=0.54%, 10=0.07%
  cpu          : usr=0.84%, sys=3.83%, ctx=65679, majf=0, minf=25
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=65536/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=262144KB, aggrb=31371KB/s, minb=31371KB/s, maxb=31371KB/s, mint=8356msec, maxt=8356msec

Disk stats (read/write):
  xvda1: ios=65323/0, merge=0/0, ticks=32844/0, in_queue=32844, util=98.73%