assignment1/benchmarks/aws/disk_benchmark_randread_2017-06-15:08:26:12.out
randread: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
randread: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
randread: Laying out IO file(s) (1 file(s) / 64MB)
randread: Laying out IO file(s) (1 file(s) / 64MB)
randread: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randread: (groupid=0, jobs=4): err= 0: pid=5211: Thu Jun 15 08:26:59 2017
  read : io=262144KB, bw=51502KB/s, iops=12875, runt=  5090msec
    clat (usec): min=41, max=8497, avg=304.48, stdev=208.16
     lat (usec): min=41, max=8498, avg=305.32, stdev=208.15
    clat percentiles (usec):
     |  1.00th=[   65],  5.00th=[   81], 10.00th=[   94], 20.00th=[  165],
     | 30.00th=[  197], 40.00th=[  241], 50.00th=[  282], 60.00th=[  314],
     | 70.00th=[  370], 80.00th=[  430], 90.00th=[  516], 95.00th=[  612],
     | 99.00th=[  820], 99.50th=[  956], 99.90th=[ 2064], 99.95th=[ 2672],
     | 99.99th=[ 8256]
    bw (KB  /s): min=10408, max=16824, per=24.92%, avg=12831.60, stdev=1847.20
    lat (usec) : 50=0.38%, 100=11.67%, 250=29.08%, 500=47.56%, 750=9.65%
    lat (usec) : 1000=1.23%
    lat (msec) : 2=0.31%, 4=0.09%, 10=0.03%
  cpu          : usr=1.34%, sys=6.17%, ctx=65715, majf=0, minf=25
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=65536/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=262144KB, aggrb=51501KB/s, minb=51501KB/s, maxb=51501KB/s, mint=5090msec, maxt=5090msec

Disk stats (read/write):
  xvda1: ios=65237/0, merge=0/0, ticks=19380/0, in_queue=19380, util=97.70%