assignment1/benchmarks/aws/disk_benchmark_randrw_2017-06-14:13:32:47.out
randrw: (g=0): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
randrw: (g=0): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
randrw: Laying out IO file(s) (1 file(s) / 64MB)
randrw: Laying out IO file(s) (1 file(s) / 64MB)
randrw: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randrw: (groupid=0, jobs=4): err= 0: pid=5219: Wed Jun 14 13:33:44 2017
  read : io=130880KB, bw=49840KB/s, iops=12460, runt=  2626msec
    clat (usec): min=41, max=8648, avg=301.02, stdev=295.14
     lat (usec): min=42, max=8649, avg=301.83, stdev=295.13
    clat percentiles (usec):
     |  1.00th=[   52],  5.00th=[   77], 10.00th=[  109], 20.00th=[  161],
     | 30.00th=[  189], 40.00th=[  215], 50.00th=[  255], 60.00th=[  286],
     | 70.00th=[  318], 80.00th=[  390], 90.00th=[  540], 95.00th=[  668],
     | 99.00th=[ 1032], 99.50th=[ 1304], 99.90th=[ 2672], 99.95th=[ 8256],
     | 99.99th=[ 8384]
    bw (KB  /s): min=10864, max=13704, per=24.98%, avg=12449.60, stdev=751.64
  write: io=131264KB, bw=49986KB/s, iops=12496, runt=  2626msec
    clat (usec): min=5, max=282, avg= 7.29, stdev= 3.90
     lat (usec): min=6, max=283, avg= 8.16, stdev= 4.41
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    6], 20.00th=[    6],
     | 30.00th=[    6], 40.00th=[    6], 50.00th=[    7], 60.00th=[    7],
     | 70.00th=[    8], 80.00th=[    8], 90.00th=[    9], 95.00th=[   10],
     | 99.00th=[   15], 99.50th=[   17], 99.90th=[   24], 99.95th=[   61],
     | 99.99th=[  195]
    bw (KB  /s): min=10984, max=13792, per=25.02%, avg=12507.60, stdev=748.93
    lat (usec) : 10=46.11%, 20=3.85%, 50=0.43%, 100=4.01%, 250=19.91%
    lat (usec) : 500=19.70%, 750=4.34%, 1000=1.08%
    lat (msec) : 2=0.46%, 4=0.07%, 10=0.04%
  cpu          : usr=2.19%, sys=8.80%, ctx=33004, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32720/w=32816/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=130880KB, aggrb=49840KB/s, minb=49840KB/s, maxb=49840KB/s, mint=2626msec, maxt=2626msec
  WRITE: io=131264KB, aggrb=49986KB/s, minb=49986KB/s, maxb=49986KB/s, mint=2626msec, maxt=2626msec

Disk stats (read/write):
  xvda1: ios=31484/1, merge=0/0, ticks=9264/0, in_queue=9256, util=94.55%