assignment1/benchmarks/aws/disk_benchmark_randrw_2017-06-15:08:26:12.out
randrw: (g=0): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
randrw: (g=0): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
randrw: Laying out IO file(s) (1 file(s) / 64MB)
randrw: Laying out IO file(s) (1 file(s) / 64MB)
randrw: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randrw: (groupid=0, jobs=4): err= 0: pid=5225: Thu Jun 15 08:27:06 2017
  read : io=130880KB, bw=39315KB/s, iops=9828, runt=  3329msec
    clat (usec): min=39, max=5109, avg=389.67, stdev=227.80
     lat (usec): min=40, max=5110, avg=390.47, stdev=227.79
    clat percentiles (usec):
     |  1.00th=[   70],  5.00th=[  141], 10.00th=[  179], 20.00th=[  245],
     | 30.00th=[  282], 40.00th=[  318], 50.00th=[  374], 60.00th=[  406],
     | 70.00th=[  442], 80.00th=[  506], 90.00th=[  604], 95.00th=[  708],
     | 99.00th=[  988], 99.50th=[ 1224], 99.90th=[ 2864], 99.95th=[ 4256],
     | 99.99th=[ 4448]
    bw (KB  /s): min= 8808, max=10632, per=24.99%, avg=9826.33, stdev=598.03
  write: io=131264KB, bw=39430KB/s, iops=9857, runt=  3329msec
    clat (usec): min=5, max=88, avg= 7.22, stdev= 2.00
     lat (usec): min=6, max=115, avg= 8.06, stdev= 2.16
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    6], 20.00th=[    6],
     | 30.00th=[    6], 40.00th=[    6], 50.00th=[    7], 60.00th=[    7],
     | 70.00th=[    8], 80.00th=[    8], 90.00th=[    9], 95.00th=[   10],
     | 99.00th=[   13], 99.50th=[   15], 99.90th=[   22], 99.95th=[   33],
     | 99.99th=[   75]
    bw (KB  /s): min= 8808, max=10744, per=24.97%, avg=9847.33, stdev=728.20
    lat (usec) : 10=46.10%, 20=3.91%, 50=0.08%, 100=1.23%, 250=9.29%
    lat (usec) : 500=28.92%, 750=8.57%, 1000=1.42%
    lat (msec) : 2=0.36%, 4=0.08%, 10=0.04%
  cpu          : usr=0.93%, sys=7.44%, ctx=32823, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32720/w=32816/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=130880KB, aggrb=39315KB/s, minb=39315KB/s, maxb=39315KB/s, mint=3329msec, maxt=3329msec
  WRITE: io=131264KB, aggrb=39430KB/s, minb=39430KB/s, maxb=39430KB/s, mint=3329msec, maxt=3329msec

Disk stats (read/write):
  xvda1: ios=30402/1, merge=0/0, ticks=12024/0, in_queue=12020, util=96.28%