assignment1/benchmarks/aws/disk_benchmark_randwrite_2017-06-13:21:10:28.out
randwrite: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
randwrite: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randwrite: (groupid=0, jobs=4): err= 0: pid=5993: Tue Jun 13 21:11:14 2017
  write: io=262144KB, bw=208880KB/s, iops=52219, runt=  1255msec
    clat (usec): min=5, max=64863, avg=48.37, stdev=1192.94
     lat (usec): min=6, max=64864, avg=52.04, stdev=1230.07
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    6], 50.00th=[    6], 60.00th=[    6],
     | 70.00th=[    6], 80.00th=[    6], 90.00th=[    6], 95.00th=[    7],
     | 99.00th=[    8], 99.50th=[   10], 99.90th=[15936], 99.95th=[36608],
     | 99.99th=[45824]
    bw (KB  /s): min=37643, max=61023, per=23.76%, avg=49638.43, stdev=8736.13
    lat (usec) : 10=99.48%, 20=0.26%, 50=0.04%, 100=0.01%, 250=0.01%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.04%, 20=0.06%, 50=0.07%
    lat (msec) : 100=0.01%
  cpu          : usr=9.32%, sys=17.27%, ctx=213, majf=0, minf=31
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=262144KB, aggrb=208879KB/s, minb=208879KB/s, maxb=208879KB/s, mint=1255msec, maxt=1255msec

Disk stats (read/write):
  xvda1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%