assignment1/benchmarks/aws/disk_benchmark_randwrite_2017-06-14:13:32:47.out
randwrite: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
randwrite: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randwrite: (groupid=0, jobs=4): err= 0: pid=5212: Wed Jun 14 13:33:39 2017
  write: io=262144KB, bw=212434KB/s, iops=53108, runt=  1234msec
    clat (usec): min=5, max=65636, avg=42.31, stdev=1132.03
     lat (usec): min=6, max=65637, avg=49.71, stdev=1203.61
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    6], 50.00th=[    6], 60.00th=[    6],
     | 70.00th=[    6], 80.00th=[    6], 90.00th=[    6], 95.00th=[    7],
     | 99.00th=[    8], 99.50th=[    9], 99.90th=[12096], 99.95th=[34560],
     | 99.99th=[48896]
    bw (KB  /s): min=32141, max=68788, per=24.59%, avg=52241.62, stdev=11789.76
    lat (usec) : 10=99.57%, 20=0.24%, 50=0.03%, 100=0.01%, 250=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.03%, 20=0.05%, 50=0.06%
    lat (msec) : 100=0.01%
  cpu          : usr=9.49%, sys=17.66%, ctx=202, majf=0, minf=34
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=262144KB, aggrb=212434KB/s, minb=212434KB/s, maxb=212434KB/s, mint=1234msec, maxt=1234msec

Disk stats (read/write):
  xvda1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%